Repository: EugenioGandini/PascalStorage
Catalog: lib/I18n/app_*.arb
Languages: it

# titleSignIn
source: Sign-in
it: Accesso

# loginSuccess
source: Sign-in successfully
it: Accesso effettuato

# loginFailed
source: Login failed. Please retry
it: Accesso fallito. Si prega di riprovare

# validatorEmptyHost
source: Your host (e.g.: https://example.com:3000)
it: Il tuo host (e.g.: https://example.com:3000)

# validatorStartNameHost
source: Host must start with https or http
it: L'host deve iniziare con https oppure http

# validatorEndNameHost
source: Host must NOT end with '/'
it: L'Host NON deve terminare con '/'

source: Username
it: Nome utente

# validatorEmptyUsername
source: Please enter a username
it: Si prega di inserire il nome utente

source: Password
it: Parola d'ordine

# validatorEmptyPassword
source: Please enter a password
it: Si prega di inserire la parola d'ordine

source: Save credentials
it: Salva le credenziali

source: Save
it: Salva

source: Enter
it: Entra

source: Exit
it: Esci

# titleMyStorage
source: My Storage
it: Il mio Spazio

# downloadSuccess
source: File downloaded successfully
it: File scaricato con successo

# uploadSuccess
source: File uploaded successfully
it: File caricato con successo

# selectFileToBeUploaded
source: Select the file that should be uploaded
it: Seleziona il file da caricare

# downloadTitle
source: Download operations
it: Scaricamento

source: Download
it: Scarica

# askDownloadTitle
source: Download the resource?
it: Scaricare la risorsa?

# askDownloadMessage
source: Do you want to download locally the resources?
it: Vuoi scaricare localmente queste risorse?

source: Save to...
it: Salva in...

# deleteSuccess
source: Deletion completed
it: Rimozione completata

# deleteFileSuccess
source: File deleted successfully
it: File rimosso con successo

# deleteFolderSuccess
source: Folder deleted successfully
it: Cartella rimossa con successo

# deleteTitle
source: Destructive operations
it: Operazioni distruttive

source: Delete
it: Elimina

# modifyTitle
source: Modification operations
it: Modifiche

source: Move to...
it: Sposta in...

source: Rename into...
it: Rinomina in...

# renameResourceSuccess
source: Re-name resource completed
it: Ri-nominazione risorsa completata

# dialogTitleRename
source: Rename resource
it: Rinomina la risorsa

source: Re-name
it: Rinomina

source: New name
it: Nuovo nome

# validatorEmptyName
source: A name must be inserted
it: Deve essere inserito un nome

# validatorSameName
source: The inserted name has not been changed
it: Il nome inserito non è cambiato

# dialogDeleteTitle
source: Delete resource
it: Elimina la risorsa

# dialogDeleteMessage
source: Are you sure you want to delete this resource
it: Sei sicuro di voler eliminare questa risorsa

source: Yes
it: Sì

source: Fullname
it: Nome completo

# validatorMissingExtension
source: An extension must be provided
it: Deve essere fornita un'estensione

source: Create
it: Crea

# dialogTitleNewFolder
source: Create a new folder
it: Crea una nuova cartella

# dialogTitleNewFile
source: Create a new file
it: Crea un nuovo file

# newResourceCreatedSuccess
source: New resource created successfully
it: La nuova risorsa è stata creata con successo

# resourceMovedSuccess
source: The resource has been moved successfully
it: La risorsa è stata spostata con successo

# footerAuthor
source: Created by Eugenio Gandini
it: Creata da Eugenio Gandini

# footerAppVersion
source: App Version: {version} (Winter 2024)
it: Versione App: {version} (Primavera 2025)

# settingsLabelRemote
source: Remote
it: Remoto

# settingsLabelSettings
source: Settings
it: Impostazioni

# titleSettings
source: App Settings
it: Impostazioni App

# defaultFolderDownload
source: Default download path
it: Percorso predefinito download

# defaultFolderDownloadChanged
source: Default folder changed
it: Cartella predefinita modificata

source: Download folder
it: Cartella download

source: Host changed
it: Host cambiato

# dialogTitleNewHost
source: Change host
it: Cambio host

# errorLoadContent
source: Error while loading the content
it: Errore nel caricamento del contenuto

# errorLoadContentHint
source: Retry or check your connectivity with the host
it: Riprovare o controllare la connessione con l'host

# noContent
source: Empty folder
it: Cartella vuota

# noContentHint
source: Add some files or create sub-folders
it: Aggiungi dei file o crea delle sotto-cartelle

# behaviourChanged
source: Changed behaviour
it: Comportamento cambiato

# openFileUponDownload
source: Open downloaded files automatically
it: Apri i file scaricati automaticamente

# titleOfflinePage
source: Offline resources
it: Risorse offline

# settingsLabelOffline
source: Offline saved resources
it: Risorse salvate offline

# enterOffline
source: Enter in offline mode
it: Entra in modalità offline

# userNotLoggedIn
source: You are NOT logged in yet
it: NON hai effettuato l'accesso

source: login required
it: accesso richiesto

# noOfflineFilesSaved
source: No offline file saved
it: Nessun file salvato offline

# noOfflineFileHint
source: You can save any remote file to access them when offline
it: Puoi salvare qualunque file remoto per accedervi quando sei offline

# syncTitle
source: Synchronization
it: Sincronizzazione

# syncActivate
source: Activate
it: Attiva

# syncDeactivate
source: Deactivate
it: Disattiva

# syncAtLogin
source: Always execute a sync at user login
it: Esegui sempre una sincronizzazione quando l'utente entra

# periodicSync
source: Sync files every {durationSyncMin} minutes and {durationSyncSec} seconds
it: Sincronizza i file ogni {durationSyncMin} minuti e {durationSyncSec} secondi

# frequencySeconds
source: Frequency in seconds
it: Frequenza in secondi

# dialogTitleNewFrequency
source: Change frequency
it: Cambia frequenza

# frequencySyncUpdated
source: Sync frequency updated
it: Frequenza di sincronizzazione aggiornata

source: Sync disable
it: Sincronizzazione disabilitata
